In [10]:
import pandas as pd

In [11]:
# ans :1
sr=pd.Series([4,8,15,16,23,42])
print(sr)
df=pd.DataFrame({'Name':['Alice','Bob','Claire'],
                'Age':[25,30,27],
                'Gender':['Female','Male','Female']})
print(df)
df.sort_values('Age')
df.set_index('Name')
print(df.shape)
print(df.columns)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
(3, 3)
Index(['Name', 'Age', 'Gender'], dtype='object')

In [12]:
# ans : 2
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

In [13]:
new_index=list(range(1,6,2))
new_column=list(range(1,6,2))

In [14]:
df['new_col']=new_column

In [15]:
df.set_index('new_col')

         A  B  C
new_col
1        1  4  7
3        2  5  8
5        3  6  9

In [16]:
# ans : 3
df=pd.DataFrame({"index":[1,2,3,4,5],'values':[10,20,30,40,50]})

In [17]:
df

   index  values
0      1      10
1      2      20
2      3      30
3      4      40
4      5      50

In [18]:
def iter(df):
    sum=0
    for i in range(0,3):
        sum += df['values'][i]
    print(sum)

In [19]:
iter(df)

60

In [20]:
# ans : 4
df['text']=['hello brother','i m pratik rathod','i a m a data scientist','i am passionate about data science','i love data']

In [21]:
def count1():
    ls=[]
    for i in df['text']:
        ls.append(len(i.split(' ')))
    return ls

In [22]:
count1()

[2, 4, 6, 6, 3]

In [23]:
df['word_count']=count1()

In [24]:
df

   index  values                                text  word_count
0      1      10                       hello brother           2
1      2      20                   i m pratik rathod           4
2      3      30              i a m a data scientist           6
3      4      40  i am passionate about data science           6
4      5      50                         i love data           3

In [25]:
df['word_count2']=df['text'].apply(lambda x:len(x.split(' ')))

In [26]:
df

   index  values                                text  word_count  word_count2
0      1      10                       hello brother           2            2
1      2      20                   i m pratik rathod           4            4
2      3      30              i a m a data scientist           6            6
3      4      40  i am passionate about data science           6            6
4      5      50                         i love data           3            3

In [27]:
# ans : 5
print(df.size)    # it will show total sum of elements in dataframe.
print(df.shape)     # it will show count of rows and columns

25
(5, 5)

In [28]:
# ans :6 
# we use to read excel 'pd.read_excel()' function

In [29]:
# ans :7

df['email']=['pra@gmail.com','prat@gmail.com','prati@yahoo.com','pratik@gmail.com','pratik1@gmail.com']

In [30]:
df

,index,values,text,word_count,word_count2,email
0,1,10,hello brother,2,2,pra@gmail.com
1,2,20,i m pratik rathod,4,4,prat@gmail.com
2,3,30,i a m a data scientist,6,6,prati@yahoo.com
3,4,40,i am passionate about data science,6,6,pratik@gmail.com
4,5,50,i love data,3,3,pratik1@gmail.com

In [31]:
df['username']=df['email'].apply(lambda x: x.split('@')[0])

In [32]:
df

,index,values,text,word_count,word_count2,email,username
0,1,10,hello brother,2,2,pra@gmail.com,pra
1,2,20,i m pratik rathod,4,4,prat@gmail.com,prat
2,3,30,i a m a data scientist,6,6,prati@yahoo.com,prati
3,4,40,i am passionate about data science,6,6,pratik@gmail.com,pratik
4,5,50,i love data,3,3,pratik1@gmail.com,pratik1

In [33]:
# ans : 8/
df=pd.DataFrame({'A':[3,8,6,2,9],
                'B':[5,2,9,3,1],
                'C':[1,7,4,5,2]})

In [34]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [35]:
df['A'] >5

0    False
1     True
2     True
3    False
4     True
Name: A, dtype: bool

In [36]:
df['B'] < 10

0    True
1    True
2    True
3    True
4    True
Name: B, dtype: bool

In [37]:
new_df=df[(df['A'] >5 ) & (df['B'] < 10)]
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [38]:
# ans : 9
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [39]:
df=pd.DataFrame({'Values':[1,2,3,6,5,4,7,4,1,2,5,8]})

In [40]:
df

    Values
0        1
1        2
2        3
3        6
4        5
5        4
6        7
7        4
8        1
9        2
10       5
11       8

In [41]:
def a(df):
    print(df.mean())
    print(df.median())
    print(df.std())

In [42]:
a(df)

Values    4.0
dtype: float64
Values    4.0
dtype: float64
Values    2.296242
dtype: float64

In [43]:
date=pd.date_range('2022-04-15','2022-04-30')
date

DatetimeIndex(['2022-04-15', '2022-04-16', '2022-04-17', '2022-04-18',
               '2022-04-19', '2022-04-20', '2022-04-21', '2022-04-22',
               '2022-04-23', '2022-04-24', '2022-04-25', '2022-04-26',
               '2022-04-27', '2022-04-28', '2022-04-29', '2022-04-30'],
              dtype='datetime64[ns]', freq='D')

In [44]:
len(date)

16

In [45]:
sales=[10,11,13,21,20,14,15,12,16,9,8,5,2,12,15,7]

In [46]:
len(sales)

16

In [47]:
df=pd.DataFrame({'Date':date,'Sales':sales})
df

         Date  Sales
0  2022-04-15     10
1  2022-04-16     11
2  2022-04-17     13
3  2022-04-18     21
4  2022-04-19     20
5  2022-04-20     14
6  2022-04-21     15
7  2022-04-22     12
8  2022-04-23     16
9  2022-04-24      9
10 2022-04-25      8
11 2022-04-26      5
12 2022-04-27      2
13 2022-04-28     12
14 2022-04-29     15
15 2022-04-30      7

In [48]:
# ans : 10
df.rolling(window=7).mean()

C:\Users\HP\AppData\Local\Temp\ipykernel_11132\2277696537.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df.rolling(window=7).mean()

        Sales
0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
5         NaN
6   14.857143
7   15.142857
8   15.857143
9   15.285714
10  13.428571
11  11.285714
12   9.571429
13   9.142857
14   9.571429
15   8.285714

In [56]:
# ans : 11
weekend=['sunday','monday','tuesday','wednesday','friday','saturday']

In [55]:
len1=16
while len1 >0:
    for i in weekend:
        print(i)

16

In [58]:
# ans :12
df=pd.date_range('2022-12-15',"2023-02-15")

In [62]:
df[(df.month ==1) & (df.year == 2023)]

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

In [63]:
# ans : 13
#  numpy